Revit 2024 API
Wave.WaveNumWaveSets Property
 The property labeled "Number" from the "Wave" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string WaveNumWaveSets { get; }
Visual Basic
Public Shared ReadOnly Property WaveNumWaveSets As String
	Get
Visual C++
public:
static property String^ WaveNumWaveSets {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyInteger" within the range of "1, 50".
See Also
Wave Class
Autodesk.Revit.DB.Visual Namespace